(function (w) {
    var bank = w.bank || [
        '中国建设银行','中国工商银行','中国农业银行','中国邮政储蓄','中国银行','招商银行','交通银行','中国民生银行','中国光大银行','平安银行','中信银行','兴业银行','广发银行','华夏银行','安徽省农村信用社','保定银行','包商银行','北京农商银行','渤海银行','长沙银行','朝阳银行','重庆银行','重庆农村商业银行','重庆三峡银行','大连银行','丹东银行','德州银行','东莞农村商业银行','东亚银行','福建省农村信用社联合社','甘肃银行','甘肃省农村信用社联合社','赣州银行','广发银行','广州农村商业银行','桂林银行','贵阳银行','贵州银行','海南省农村信用社联合社','海南银行','杭州银行','汉口银行','河北银行','黑龙江省农村信用社联合社','华融湘江银行','华夏银行','湖北银行','湖北省农村信用社','汇丰银行','湖南省农村信用社联合社','江苏银行','江苏农村商业银行','江西省农商银行','交通银行','焦作中旅银行','吉林省农村信用社联合社','济宁银行','锦州银行','兰州银行','洛阳银行','南京银行','内蒙古银行','内蒙古农村信用社','宁波银行','平安银行','平顶山银行','浦发银行','齐鲁银行','青岛银行','青海银行','青海省农村信用社联合社','青隆村镇银行','上海银行','上海农商银行','陕西省农村信用社联合社','盛京银行','广东顺德农村商业银行','四川省农村信用社','四川天府银行','苏州银行','太仓农村商业银行','台州银行','天津滨海农村商业银行','天津银行','温州银行','武汉农村商业银行','无锡农村商业银行','厦门银行','兴业银行','新疆省农村信用社','鄞州银行','张家港农村商业银行','招商银行','浙江民泰商业银行','郑州银行','中原银行'
    ];
    w.bank = bank;
})(window);